/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: majosue <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/11/12 12:19:17 by majosue           #+#    #+#             */
/*   Updated: 2019/11/12 12:31:39 by majosue          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <stdarg.h> 
 
int sum(int n, ...)
{
    int result = 0;
    // получаем указатель на параметр n
    for(int *ptr = &n;n>0; n--)
    {
        result+= *(++ptr);
    }
    return result;
}
 
int main(void)
{   
    printf("%d \n", sum(4, 1, 2, 3, 4));
    printf("%d \n", sum(5, 12, 21, 13, 4, 5));
    return 0;
}